''' Стандартные и сторонние библиотеки Python '''
# 1. Фреймворк; 2. Библиотека/пакет; 3. Модуль
# pip search <ключевое слово> - найти все пакеты на PyPI с этим словом
# pip install <имя пакета> - найти и установить последнюю версию пакета
# pip install <имя пакета>==1.2.3 - найти и установить версию пакета 1.2.3
# pip install --upgrade <имя пакета> - обновить версию установленного пакета до последней
# pip install --upgrade <имя пакета>==1.2.3 - обновить версию установленного пакета до указанной (1.2.3)
# pip uninstall <имя пакета> - удалить пакет
# pip freeze - выдать список установленных пакетов с версиями
# pip freeze > requirements.txt - создать файл requirements.txt и записать в него список установленных пакетов с версиями
# pip install -r requirements.txt - установить все пакеты перечисленные в файле requirements.txt, указанных в данном файле версий
